fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиеПотраченоЧасов</name>
      <type>
        <types>DefinedType.ВКМ_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>DefinedType.ВКМ_Денежный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>DefinedType.ВКМ_Количество</types>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботыСпециалиста</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора");
	
	Если ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		СинонимДоговораОбслуживания = Метаданные.Перечисления.ВидыДоговоровКонтрагентов.ЗначенияПеречисления.ВКМ_АбоненскоеОбслуживание.Синоним;
		ТекстСообщения = СтрШаблон("Отказ проведения. Вид договора должен быть ""%1""!", СинонимДоговораОбслуживания);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ДатаОкончанияДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_ДатаНачала");
	ДатаНачалаДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_ДатаОкончания");
	
	Если ДатаНачалаДоговора < ДатаПроведенияРабот
		ИЛИ ДатаОкончанияДоговора > ДатаПроведенияРабот Тогда
		ТекстСообщения = "Отказ проведения. Дата документа не входим в интервал даты проведения работ!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	КонецЕсли;

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	ДанныеПроведения = ПолучитьДанныеПроведенияДляОбъекта();
	
	Если ДанныеПроведения.Следующий() Тогда
		
		Если ДанныеПроведения.ПроцентОтРабот = "не установлено" Тогда
			ТекстСообщения = "Отказ проведения. Специалисту не установлен процент от работ на месяц документа!";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;
	
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = ДанныеПроведения.Дата;
		Движение.Клиент = ДанныеПроведения.Клиент;
		Движение.Договор = ДанныеПроведения.Договор;	
		Движение.КоличествоЧасов = ДанныеПроведения.ЧасовВыполненоКлиент;
		Движение.СуммаКОплате = ДанныеПроведения.СуммаКОплатеКлиент;
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = ДанныеПроведения.Дата;
		Движение.Сотрудник = ДанныеПроведения.Специалист;	
		Движение.ЧасовКОплате = ДанныеПроведения.ЧасовКОплатеКлиент;
		Движение.СуммаКОплате = ДанныеПроведения.СуммаКОплатеСотрудник;
	
	КонецЕсли;
			
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	ТекстИзменений = "";
	
	Если ЭтоНовый() Тогда
		ТекстИзменений = СтрШаблон("Появился новый документ %1!", Метаданные.Документы.ВКМ_ОбслуживаниеКлиента.Синоним);
	Иначе
		ПроверкаИзмененийРеквизитов(ТекстИзменений);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстИзменений) Тогда
		СправочникУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		СправочникУведомление.ТекстСообщения = ТекстИзменений;
		СправочникУведомление.Записать();
		
		//Принудительно запускаем задание, чтобы сразу отправить уведомление в Телеграм
		ЗапуститьРегламентноеЗадание();			
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаИзмененийРеквизитов(ТекстИзменений)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан,
		|	ВКМ_ОбслуживаниеКлиента.Специалист,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВКМ_ОбслуживаниеКлиента.Ссылка) КАК Ссылка
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|	И ВКМ_ОбслуживаниеКлиента.Проведен = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.ДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
			Изменение = СтрШаблон("Изменена дата проведения работ: %1 для документа %2. ",
				Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"), Выборка.Ссылка);
			ТекстИзменений = ТекстИзменений + Изменение;
		КонецЕсли;
		
		Если Выборка.ВремяНачалаРаботПлан <> ВремяНачалаРаботПлан Тогда
			Изменение = СтрШаблон("Изменено время начала работ: %1 для документа %2. ",
				Формат(ВремяНачалаРаботПлан, "ДЛФ=T"), Выборка.Ссылка);
			ТекстИзменений = ТекстИзменений + Изменение;
		КонецЕсли;
		
		Если Выборка.ВремяОкончанияРаботПлан <> ВремяОкончанияРаботПлан Тогда
			Изменение = СтрШаблон("Изменено время окончания работ: %1 для документа %2. ",
				Формат(ВремяОкончанияРаботПлан, "ДЛФ=T"), Выборка.Ссылка);
			ТекстИзменений = ТекстИзменений + Изменение;
		КонецЕсли;
		
		Если Выборка.Специалист <> Специалист Тогда
			Изменение = СтрШаблон("Назначен новый специалист: %1 для документа %2. ", Специалист,
				Выборка.Ссылка);
			ТекстИзменений = ТекстИзменений + Изменение;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗапуститьРегламентноеЗадание()
   
   ИмяМетода = Метаданные.РегламентныеЗадания.ОтправкаУведомленийВТелеграмЧат.ИмяМетода;

   Отбор = Новый Структура;
   Отбор.Вставить("ИмяМетода", "ОтправкаУведомленийВТелеграмЧат");
   Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
   ФоновыеЗаданияОчистки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);

	Если ФоновыеЗаданияОчистки.Количество() = 0 Тогда
		
   		НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
   			НСтр("ru = 'Запуск вручную: %1'"), "ОтправкаУведомленийВТелеграмЧат");
   		ФоновыеЗадания.Выполнить(ИмяМетода,,, НаименованиеФоновогоЗадания);
   		
   	КонецЕсли;
   
КонецПроцедуры

Функция ПолучитьДанныеПроведенияДляОбъекта()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка КАК Ссылка,
	|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасовКОплатеКлиенту,
	|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ФактическиеПотраченоЧасов) КАК ФактическиеПотраченоЧасов
	|ПОМЕСТИТЬ ВТ_ПотраченныеЧасыИтог
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
	|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботыСпециалиста КАК СтоимостьЧасаРаботыСпециалиста,
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	|	ВТ_ПотраченныеЧасыИтог.ЧасовКОплатеКлиенту * ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботыСпециалиста КАК
	|		СуммаКОплатеКлиент,
	|	ВТ_ПотраченныеЧасыИтог.ЧасовКОплатеКлиенту * ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботыСпециалиста *
	|		ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот / 100 КАК СуммаКОплатеСотрудник,
	|	ВТ_ПотраченныеЧасыИтог.ЧасовКОплатеКлиенту КАК ЧасовКОплатеКлиент,
	|	ВТ_ПотраченныеЧасыИтог.ФактическиеПотраченоЧасов КАК ЧасовВыполненоКлиент,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, ""не установлено"") КАК ПроцентОтРабот
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПотраченныеЧасыИтог КАК ВТ_ПотраченныеЧасыИтог
	|		ПО ВТ_ПотраченныеЧасыИтог.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК
	|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#КонецЕсли
